<template>
  <div class="taxi">
    <div class="taxi__container">
      <div class="taxi__inner">
        <div class="taxi__block">
          <img src="../assets/img/man.webp" alt="..." loading="lazy" />
        </div>
        <div class="taxi__block">
          <h2 class="title taxi__title">Что такое ОСГОП такси?</h2>
          <div class="taxi__description">
            <p>
              Договор ОСГОП такси защищает имущественные интересы перевозчика
              в&nbsp;случае причинения вреда жизни, здоровью или имуществу
              пассажиров.
            </p>
            <p>
              Например, компенсация выплачивается, если пассажир получил травму
              в&nbsp;ДТП. Размер выплаты зависит от&nbsp;характера травм
              и&nbsp;установлен Законодательством.
            </p>
            <p>
              Размер выплаты зависит от характера травм и установлен
              Законодательством.
            </p>
          </div>
          <div class="taxi__varning">
            <span>
              <svg
                width="22"
                height="20"
                viewBox="0 0 22 20"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M21.6755 15.9459L13.0539 1.63258C12.6229 0.908773 11.8616 0.474487 10.9994 0.474487C10.1373 0.474487 9.37599 0.908773 8.95409 1.63258L0.32331 15.9459C-0.10777 16.6878 -0.10777 17.5654 0.32331 18.2983C0.75439 19.0312 1.52483 19.4745 2.37782 19.4745H19.6302C20.4924 19.4745 21.2628 19.0312 21.6847 18.2983C22.1066 17.5654 22.1066 16.6878 21.6755 15.9459ZM20.098 17.3935C20.0521 17.475 19.9145 17.6559 19.6302 17.6559H2.36865C2.08432 17.6559 1.94674 17.4659 1.90088 17.3935C1.85502 17.3212 1.7633 17.104 1.90088 16.8597L10.5317 2.54639C10.6692 2.31115 10.9077 2.28401 10.9994 2.28401C11.0911 2.28401 11.3204 2.31115 11.4672 2.55544L20.0888 16.8688C20.2355 17.104 20.1347 17.3212 20.0888 17.4026L20.098 17.3935ZM10.0822 6.80782H11.9166V12.2364H10.0822V6.80782ZM10.0822 14.0459H11.9166V15.8554H10.0822V14.0459Z"
                  fill="#FFBB00"
                />
              </svg>
            </span>
            <p>
              Договор ОСГОП такси заключается, если есть разрешение
              на&nbsp;перевозчика. Наличие разрешения можно проверить на сайте
              <a href="#">ФГИС «Такси»</a> в&nbsp;разделе «Перевозчики»
            </p>
          </div>
          <div class="taxi__period">
            <span>
              <svg
                width="24"
                height="25"
                viewBox="0 0 24 25"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M12 22.4745C10.0222 22.4745 8.08879 21.888 6.4443 20.7892C4.79981 19.6904 3.51809 18.1286 2.76121 16.3013C2.00433 14.4741 1.8063 12.4634 2.19215 10.5236C2.578 8.58378 3.53041 6.80195 4.92894 5.40342C6.32746 4.0049 8.10929 3.05249 10.0491 2.66664C11.9889 2.28079 13.9996 2.47882 15.8268 3.2357C17.6541 3.99257 19.2159 5.2743 20.3147 6.91879C21.4135 8.56328 22 10.4967 22 12.4745C21.9971 15.1258 20.9426 17.6676 19.0679 19.5424C17.1932 21.4171 14.6513 22.4716 12 22.4745ZM12 4.14116C10.3518 4.14116 8.74066 4.6299 7.37025 5.54558C5.99984 6.46126 4.93174 7.76274 4.30101 9.28546C3.67028 10.8082 3.50525 12.4837 3.82679 14.1002C4.14834 15.7168 4.94201 17.2016 6.10745 18.367C7.27288 19.5325 8.75774 20.3262 10.3743 20.6477C11.9908 20.9692 13.6663 20.8042 15.189 20.1735C16.7117 19.5428 18.0132 18.4746 18.9289 17.1042C19.8446 15.7338 20.3333 14.1227 20.3333 12.4745C20.3309 10.2651 19.4522 8.14689 17.8899 6.58461C16.3276 5.02234 14.2094 4.14358 12 4.14116Z"
                  fill="#7D51FE"
                />
                <path
                  d="M13.6667 18.3078H12V12.4745H10.3333V10.8078H12C12.442 10.8078 12.8659 10.9834 13.1785 11.296C13.4911 11.6085 13.6667 12.0325 13.6667 12.4745V18.3078Z"
                  fill="#7D51FE"
                />
                <path
                  d="M12 9.14115C12.6904 9.14115 13.25 8.58151 13.25 7.89115C13.25 7.2008 12.6904 6.64115 12 6.64115C11.3096 6.64115 10.75 7.2008 10.75 7.89115C10.75 8.58151 11.3096 9.14115 12 9.14115Z"
                  fill="#7D51FE"
                />
              </svg>
            </span>
            Срок действия полиса:&nbsp;1 год.
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
<script>
export default {};
</script>
<style lang="scss">
.taxi {
  &__inner {
    display: grid;
    grid-template-columns: 1fr 1fr;
    gap: 24px;
    @media (max-width: 1023px) {
      grid-template-columns: 1fr;
    }
  }
  &__block {
    background-color: var(--light);
    border-radius: var(--radius);
    overflow: hidden;
    &:first-child {
    }
    &:last-child {
      padding: 32px;
    }
    img {
      width: 100%;
      height: 100%;
      object-fit: cover;
    }
  }
  &__title {
  }
  &__description {
    p {
      font-size: 16px;
      font-weight: 400;
      color: rgb(var(--color_text));
      margin-bottom: 1em;
      &:last-child {
        margin-bottom: 40px;
      }
      &:nth-child(2) {
        color: rgba(var(--color_text), 0.5);
      }
    }
  }
  &__varning {
    background-color: rgba(255, 187, 0, 0.1);
    margin-bottom: 16px;
    padding: 12px;
    display: flex;
    border-radius: 4px;
    gap: 12px;
    p {
      a {
        color: rgb(var(--primary));
      }
    }
    svg {
      flex: 0 0 25px;
      margin-bottom: -3px;
    }
  }
  &__period {
    background-color: rgba(var(--primary), 0.1);
    border-radius: 4px;
    padding: 12px;
    display: flex;
    align-items: center;
    gap: 12px;
    svg {
      margin-bottom: -3px;
      flex: 0 0 25px;
    }
  }
}
</style>
